---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallSettingsChanged
source: html/5833c9c8-9546-c5cc-7490-2391ec305902.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.WallSettingsChanged Property

Default wall settings will be changed (Base Constraint: [Base Level], Base Offset: [Base Offset], Top Constraint: [Top Level], Top Offset: [Top Offset])

## Syntax (C#)
```csharp
public static FailureDefinitionId WallSettingsChanged { get; }
```